#!/bin/sh

NFQWS_DIR="/etc/nfqws"
NFQWS_FILE="$NFQWS_DIR/roblox.list"
CONFIG_FILE="/etc/nfqws/nfqws.conf"
CUSTOM_ARGS='NFQWS_ARGS_CUSTOM="--filter-udp=49152-65535 --dpi-desync=fake --dpi-desync-repeats=10 --dpi-desync-any-protocol=1 --dpi-desync-cutoff=n2 --ipset=/etc/nfqws/roblox.list"'

# Проверяем, существует ли файл
if [ ! -f "$CONFIG_FILE" ]; then
    echo "Файл $CONFIG_FILE не найден!"
    exit 1
fi

# Проверяем, есть ли уже строка с CUSTOM_ARGS
grep -F "$CUSTOM_ARGS" "$CONFIG_FILE" > /dev/null 2>&1
if [ $? -eq 0 ]; then
    echo "Строка уже присутствует в файле."
else
    # Добавляем строку после первой строки, содержащей NFQWS_ARGS_CUSTOM
    sed -i "/NFQWS_ARGS_CUSTOM/a $CUSTOM_ARGS" "$CONFIG_FILE"
    echo "Строка добавлена в $CONFIG_FILE"
fi

# Записываем файл
cat << 'EOF' > "$NFQWS_FILE"
103.140.28.0/23
128.116.0.0/17
128.116.0.0/24
128.116.1.0/24
128.116.5.0/24
128.116.11.0/24
128.116.13.0/24
128.116.21.0/24
128.116.22.0/24
128.116.31.0/24
128.116.32.0/24
128.116.33.0/24
128.116.35.0/24
128.116.44.0/24
128.116.45.0/24
128.116.46.0/24
128.116.48.0/24
128.116.50.0/24
128.116.51.0/24
128.116.53.0/24
128.116.54.0/24
128.116.55.0/24
128.116.56.0/24
128.116.57.0/24
128.116.63.0/24
128.116.64.0/24
128.116.67.0/24
128.116.74.0/24
128.116.80.0/24
128.116.81.0/24
128.116.84.0/24
128.116.86.0/24
128.116.87.0/24
128.116.88.0/24
128.116.95.0/24
128.116.97.0/24
128.116.99.0/24
128.116.102.0/24
128.116.104.0/24
128.116.105.0/24
128.116.115.0/24
128.116.116.0/24
128.116.117.0/24
128.116.119.0/24
128.116.120.0/24
128.116.123.0/24
128.116.127.0/24
141.193.3.0/24
205.201.62.0/24
2620:2b:e000::/48
2620:135:6000::/40
2620:135:6004::/48
2620:135:6007::/48
2620:135:6008::/48
2620:135:6009::/48
2620:135:600a::/48
2620:135:600b::/48
2620:135:600c::/48
2620:135:600d::/48
2620:135:600e::/48
2620:135:6041::/48
EOF

echo "Файл $NFQWS_FILE создан"


service nfqws-keenetic restart
service nfqws-keenetic status
